       program-id. FirstProgram.

       environment division.
       configuration section.

       data division.
       working-storage section.
       linkage section.

       procedure division.
           display "message"
           goback.

       end program FirstProgram.
