       program-id. base.

       environment division.
       configuration section.

       data division.

       working-storage section.

       linkage section.

       procedure division.



           display "ddfdf".

           goback .


       end program base.