       program-id. basic1.

       environment division.
       configuration section.

       data division.
       working-storage section.
       linkage section.

       procedure division.
           


           display "TEST"
           goback.

       end program basic1.
